# Список
# Список (list) представляет тип данных, который хранит набор или последовательность элементов.
# Для создания списка в квадратных скобках ([]) через запятую перечисляются все его элементы.

numbers1 = [1, 2, 3, 4, 5]
numbers2 = list(numbers1)

# Кортежи
# Кортеж (tuple) представляет последовательность элементов,
# которая во многом похожа на список за тем исключением, что кортеж является неизменяемым (immutable) типом.

users1 = ("Tom", "Sam", "Mike")
users2 = "Tom", "Sam", "Mike"

# Словари
# Как и список, словарь хранит коллекцию элементов.
# Каждый элемент в словаре имеет уникальный ключ, с которым ассоциировано некоторое значение.

objects1 = {1: "Tom", 2: "Sam", 3: "Nike"}
objects2 = {"First": "Tom", "Second": "Sam", "Third": "Nike"}

# Множества
# Множество (set) представляют еще один вид набора элементов.
# Для определения множества используются фигурные скобки, в которых перечисляются элементы.

users = {"Tom", "Bob", "Alice", "Tom"}
